Tekla Open API Reference for Tekla Structures 2025
Grid Class
 The Grid class contains methods related to grids. A drawing grid is inserted/removed using the view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Grid
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Grid : ModelObject, IHasChildren
<SerializableAttribute>
Public NotInheritable Class Grid
	Inherits ModelObject
	Implements IHasChildren
The Grid type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the grid. For more information see Grid.GridAttributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from ModelObject.)
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
 (Inherited from ModelObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
Methods
Name | Description
Delete
 Grids cannot be deleted.
 (Overrides DatabaseObject.Delete().)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetObjects()
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid.
GetObjects(Type[])
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid that are of certain TypeFilter.
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Drawing MyDrawing = new GADrawing();
           View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
               new AABB(new Point(), new Point(30000, 30000, 10000)));
           Grid curGrid;
           DrawingObjectEnumerator allObjects = curview.GetAllObjects();
           while(allObjects.MoveNext())
           {
               if(allObjects.Current is Grid)
               {
                   curGrid = allObjects.Current as Grid;
                   curGrid.Attributes.DrawTextAtTopOfGrid = true;
                   curGrid.Attributes.Font.Color = DrawingColors.Red;
                   curGrid.Modify(); /* Apply changes */
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace